EDT/УТ/src/Enums/СобытияЗаписиЗаказа/СобытияЗаписиЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СобытияЗаписиЗаказа</name>
  <enumValues>
    <name>ЗагрузкаЗаказаИзФронта</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытиеЗаказа</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ДанныеЗаказаСамовывоза/ДанныеЗаказаСамовывоза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеЗаказаСамовывоза</name>
  <registerRecords>AccumulationRegister.ДанныеЧастичныхЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКомитентамиПоЗаказам</registerRecords>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <registerRecords>InformationRegister.СостоянияЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКомитентами</registerRecords>
  <registerRecords>AccumulationRegister.УчетДенежныхСредствКассиромРасширеный</registerRecords>
  <registerRecords>AccumulationRegister.УчетДенежныхСредствКассиром</registerRecords>
  <attributes>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеВыполненияЗаказа</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратТоваровОтПокупателя</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставкиПервоначально</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторСостояния</name>
    <type>
      <types>EnumRef.ИнициаторыСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоставленныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДоставлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/CommonForms/ЗаказыДляСамовывоза/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаСегодня = ТекущаяДата();
	
	ТерминалОбработки = ПараметрыСеанса.ТерминалДоставки; // Задача № 3045 
	
	Таблица.Параметры.УстановитьЗначениеПараметра("Событие", Перечисления.СобытияЗаписиЗаказа.ЗагрузкаЗаказаИзФронта);
	Таблица.Параметры.УстановитьЗначениеПараметра("НачалоДня", НачалоДня(ДатаСегодня));
	Таблица.Параметры.УстановитьЗначениеПараметра("КонецДня", КонецДня(ДатаСегодня));
	Таблица.Параметры.УстановитьЗначениеПараметра("Выполнена", Справочники.новаРезультатМестнойДоставки.НайтиПоКоду("000000001"));
	Таблица.Параметры.УстановитьЗначениеПараметра("ПричинаНеВыполнения", Справочники.ПричиныНеВыполненияДоставки.НайтиПоКоду("000000003"));
	Таблица.Параметры.УстановитьЗначениеПараметра("ТерминалОбработки", ТерминалОбработки); // Задача № 3045 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеДанныеЗаказаСамовывоза(ТекущиеДанные)
	Форма = ПолучитьФорму("Документ.ДанныеЗаказаСамовывоза.Форма.ФормаДокумента");
	Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	Форма.Объект.Реализация = ТекущиеДанные.Ссылка;
	Форма.ЗаполнитьДокумент(ТерминалОбработки);
	
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СозданиеДанныеЗаказаСамовывоза(Элементы.Таблица.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ДатаСегодня = ТекущаяДата();
	//ЗадатьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьОтбор()
	//ПользовательскийОтбор = Таблица.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Таблица.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки);
	//ПользовательскийОтбор.Элементы.Очистить();
	//ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.ПравоеЗначение = НачалоДня(ДатаСегодня);
	//
	//ЭлементОтбора = ПользовательскийОтбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.ПравоеЗначение = КонецДня(ДатаСегодня);
	
	Таблица.Параметры.УстановитьЗначениеПараметра("НачалоДня", НачалоДня(ДатаСегодня));
	Таблица.Параметры.УстановитьЗначениеПараметра("КонецДня", КонецДня(ДатаСегодня));
	Таблица.Параметры.УстановитьЗначениеПараметра("ТерминалОбработки", ТерминалОбработки); // Задача № 3045 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСегодняПриИзменении(Элемент)
	ЗадатьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьТаблицуЗаказыДляСамовывоза" Тогда
		Элементы.Таблица.Обновить();		
	КонецеСли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.Таблица.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ТерминалОбработкиПриИзменении(Элемент)
	ЗадатьОтбор();
КонецПроцедуры
